[Survived] StringLiteral
index.js:12:23
     inProcess: 'inprocess',
     completed: 'completed',
     canceled: 'cancelled',
-    requestSubmitted: 'requestsubmitted',
+    requestSubmitted: "",
     requestWithdrawn: 'requestwithdrawn',
     onHold: 'onhold'

[Survived] StringLiteral
index.js:17:26
     onHold: 'onhold'
   };
   const requestedStart = 'Requested Start'
-  const dateTimeFormat = 'MM/dd/yy, hh:mma'
+  const dateTimeFormat = ""
 const actionStatusProgressionMap = new Map([

[Killed] UnaryOperator
index.js:28:24
-    ['', { stateValue: -1, stateAction: 'View', showDateInTracker: true, dateLabel: 'Scheduled for', dateField: 'activityStartDate', format: dateTimeFormat, timeZone: true, statusDisplayName: '' }],
+    ['', { stateValue: +1, stateAction: 'View', showDateInTracker: true, dateLabel: 'Scheduled for', dateField: 'activityStartDate', format: dateTimeFormat, timeZone: true, statusDisplayName: '' }],
   ]);
killedBy: should highlight the current status It should have correct status tracker for each status
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 7

- Array []
+ Array [
+   "progress-active",

[Survived] BooleanLiteral
index.js:28:68
-    ['', { stateValue: -1, stateAction: 'View', showDateInTracker: true, dateLabel: 'Scheduled for', dateField: 'activityStartDate', format: dateTimeFormat, timeZone: true, statusDisplayName: '' }],
+    ['', { stateValue: -1, stateAction: 'View', showDateInTracker: false, dateLabel: 'Scheduled for', dateField: 'activityStartDate', format: dateTimeFormat, timeZone: true, statusDisplayName: '' }],
   ]);

[Killed] MethodExpression
index.js:32:58
   ]);
 function getStatusTrackerInfo(currentServiceState, statuses) {
-    const serviceConfig = actionStatusProgressionMap.get(currentServiceState?.toLowerCase()) ?? actionStatusProgressionMap.get('');
+    const serviceConfig = actionStatusProgressionMap.get(currentServiceState?.toUpperCase()) ?? actionStatusProgressionMap.get('');
     const status = statuses.find(status => status.id?.toLowerCase() === currentServiceState?.toLowerCase());
     const statusCount = 5;
killedBy: should highlight the current status It should have correct status tracker for each status
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   "progress-complete",
-   "progress-active",

[Killed] LogicalOperator
index.js:32:27
   ]);
 function getStatusTrackerInfo(currentServiceState, statuses) {
-    const serviceConfig = actionStatusProgressionMap.get(currentServiceState?.toLowerCase()) ?? actionStatusProgressionMap.get('');
+    const serviceConfig = actionStatusProgressionMap.get(currentServiceState?.toLowerCase()) && actionStatusProgressionMap.get('');
     const status = statuses.find(status => status.id?.toLowerCase() === currentServiceState?.toLowerCase());
     const statusCount = 5;
killedBy: should highlight the current status It should have correct status tracker for each status
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   "progress-complete",
-   "progress-active",

[Survived] ArrowFunction
index.js:33:34
   ]);
 function getStatusTrackerInfo(currentServiceState, statuses) {
     const serviceConfig = actionStatusProgressionMap.get(currentServiceState?.toLowerCase()) ?? actionStatusProgressionMap.get('');
-    const status = statuses.find(status => status.id?.toLowerCase() === currentServiceState?.toLowerCase());
+    const status = statuses.find(() => undefined);
     const statusCount = 5;
     if (status?.shortName && serviceConfig) {

[NoCoverage] MethodExpression
index.js:33:73
   ]);
 function getStatusTrackerInfo(currentServiceState, statuses) {
     const serviceConfig = actionStatusProgressionMap.get(currentServiceState?.toLowerCase()) ?? actionStatusProgressionMap.get('');
-    const status = statuses.find(status => status.id?.toLowerCase() === currentServiceState?.toLowerCase());
+    const status = statuses.find(status => status.id?.toLowerCase() === currentServiceState?.toUpperCase());
     const statusCount = 5;
     if (status?.shortName && serviceConfig) {

[Killed] ConditionalExpression
index.js:35:9
     const serviceConfig = actionStatusProgressionMap.get(currentServiceState?.toLowerCase()) ?? actionStatusProgressionMap.get('');
     const status = statuses.find(status => status.id?.toLowerCase() === currentServiceState?.toLowerCase());
     const statusCount = 5;
-    if (status?.shortName && serviceConfig) {
+    if (true) {
       serviceConfig.statusDisplayName = status.shortName;
     }
killedBy: should highlight the current status It should have correct status tracker for each status
statusReason: TypeError: Cannot read properties of undefined (reading 'shortName')

[Killed] OptionalChaining
index.js:35:9
     const serviceConfig = actionStatusProgressionMap.get(currentServiceState?.toLowerCase()) ?? actionStatusProgressionMap.get('');
     const status = statuses.find(status => status.id?.toLowerCase() === currentServiceState?.toLowerCase());
     const statusCount = 5;
-    if (status?.shortName && serviceConfig) {
+    if (status.shortName && serviceConfig) {
       serviceConfig.statusDisplayName = status.shortName;
     }
killedBy: should highlight the current status It should have correct status tracker for each status
statusReason: TypeError: Cannot read properties of undefined (reading 'shortName')

[Killed] LogicalOperator
index.js:38:26
     if (status?.shortName && serviceConfig) {
       serviceConfig.statusDisplayName = status.shortName;
     }
-    const currentState = serviceConfig?.stateValue ?? -1;
+    const currentState = serviceConfig?.stateValue && -1;
     const showTracker = currentState !== -1;
     let statusArr = [];
killedBy: should highlight the current status It should have correct status tracker for each status
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   "progress-complete",
-   "progress-active",

[NoCoverage] UnaryOperator
index.js:38:55
     if (status?.shortName && serviceConfig) {
       serviceConfig.statusDisplayName = status.shortName;
     }
-    const currentState = serviceConfig?.stateValue ?? -1;
+    const currentState = serviceConfig?.stateValue ?? +1;
     const showTracker = currentState !== -1;
     let statusArr = [];

[Killed] ConditionalExpression
index.js:39:25
       serviceConfig.statusDisplayName = status.shortName;
     }
     const currentState = serviceConfig?.stateValue ?? -1;
-    const showTracker = currentState !== -1;
+    const showTracker = true;
     let statusArr = [];
     let statusSubtitle = '';
killedBy: should highlight the current status It should have correct status tracker for each status
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 7

- Array []
+ Array [
+   "",

[Killed] EqualityOperator
index.js:39:25
       serviceConfig.statusDisplayName = status.shortName;
     }
     const currentState = serviceConfig?.stateValue ?? -1;
-    const showTracker = currentState !== -1;
+    const showTracker = currentState === -1;
     let statusArr = [];
     let statusSubtitle = '';
killedBy: should highlight the current status It should have correct status tracker for each status
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 7

- Array []
+ Array [
+   "",

[Killed] ArrayDeclaration
index.js:40:21
     }
     const currentState = serviceConfig?.stateValue ?? -1;
     const showTracker = currentState !== -1;
-    let statusArr = [];
+    let statusArr = ["Stryker was here"];
     let statusSubtitle = '';
     if (showTracker) {
killedBy: should highlight the current status It should have correct status tracker for each status
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "Stryker was here",

[Killed] BlockStatement
index.js:42:22
     const showTracker = currentState !== -1;
     let statusArr = [];
     let statusSubtitle = '';
-    if (showTracker) {
-      for (let status = 1; status <= statusCount; status++) {
-        let className = '';
-        if (status < currentState) {
-          className = `progress-complete`;
-        }
-        if (status === currentState) {
-          className = `progress-active`;
-        }
-        statusArr.push(className);
-      }
-    }
+    if (showTracker) {}
     if ([statusKeyMap.requestSubmitted, statusKeyMap.requestAcknowledged].includes(currentServiceState)) {
       statusSubtitle = 'reqDetails.header.submittedSubtitle';
killedBy: should highlight the current status It should have correct status tracker for each status
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   "progress-complete",
-   "progress-active",

[Killed] ConditionalExpression
index.js:42:9
     const showTracker = currentState !== -1;
     let statusArr = [];
     let statusSubtitle = '';
-    if (showTracker) {
+    if (true) {
       for (let status = 1; status <= statusCount; status++) {
         let className = '';
killedBy: should highlight the current status It should have correct status tracker for each status
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 7

- Array []
+ Array [
+   "",

[Killed] BlockStatement
index.js:43:61
     let statusArr = [];
     let statusSubtitle = '';
     if (showTracker) {
-      for (let status = 1; status <= statusCount; status++) {
-        let className = '';
-        if (status < currentState) {
-          className = `progress-complete`;
-        }
-        if (status === currentState) {
-          className = `progress-active`;
-        }
-        statusArr.push(className);
-      }
+      for (let status = 1; status <= statusCount; status++) {}
     }
     if ([statusKeyMap.requestSubmitted, statusKeyMap.requestAcknowledged].includes(currentServiceState)) {
killedBy: should highlight the current status It should have correct status tracker for each status
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   "progress-complete",
-   "progress-active",

[Killed] ConditionalExpression
index.js:43:28
     let statusArr = [];
     let statusSubtitle = '';
     if (showTracker) {
-      for (let status = 1; status <= statusCount; status++) {
+      for (let status = 1; false; status++) {
         let className = '';
         if (status < currentState) {
killedBy: should highlight the current status It should have correct status tracker for each status
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   "progress-complete",
-   "progress-active",

[Killed] StringLiteral
index.js:44:25
     let statusSubtitle = '';
     if (showTracker) {
       for (let status = 1; status <= statusCount; status++) {
-        let className = '';
+        let className = "Stryker was here!";
         if (status < currentState) {
           className = `progress-complete`;
killedBy: should highlight the current status It should have correct status tracker for each status
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    "progress-complete",
    "progress-active",

[Killed] BlockStatement
index.js:45:36
     if (showTracker) {
       for (let status = 1; status <= statusCount; status++) {
         let className = '';
-        if (status < currentState) {
-          className = `progress-complete`;
-        }
+        if (status < currentState) {}
         if (status === currentState) {
           className = `progress-active`;
killedBy: should highlight the current status It should have correct status tracker for each status
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "progress-complete",
+   "",

[Killed] EqualityOperator
index.js:45:13
     if (showTracker) {
       for (let status = 1; status <= statusCount; status++) {
         let className = '';
-        if (status < currentState) {
+        if (status >= currentState) {
           className = `progress-complete`;
         }
killedBy: should highlight the current status It should have correct status tracker for each status
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   "progress-complete",
-   "progress-active",

[Killed] EqualityOperator
index.js:48:13
         if (status < currentState) {
           className = `progress-complete`;
         }
-        if (status === currentState) {
+        if (status !== currentState) {
           className = `progress-active`;
         }
killedBy: should highlight the current status It should have correct status tracker for each status
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   "progress-complete",
    "progress-active",

[Killed] ConditionalExpression
index.js:48:13
         if (status < currentState) {
           className = `progress-complete`;
         }
-        if (status === currentState) {
+        if (true) {
           className = `progress-active`;
         }
killedBy: should highlight the current status It should have correct status tracker for each status
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   "progress-complete",
    "progress-active",

[Killed] StringLiteral
index.js:49:23
           className = `progress-complete`;
         }
         if (status === currentState) {
-          className = `progress-active`;
+          className = ``;
         }
         statusArr.push(className);
killedBy: should highlight the current status It should have correct status tracker for each status
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "progress-complete",
-   "progress-active",

[Killed] ConditionalExpression
index.js:54:9
         statusArr.push(className);
       }
     }
-    if ([statusKeyMap.requestSubmitted, statusKeyMap.requestAcknowledged].includes(currentServiceState)) {
+    if (true) {
       statusSubtitle = 'reqDetails.header.submittedSubtitle';
       statusArr = [];
killedBy: should highlight the current status It should have correct status tracker for each status
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   "progress-complete",
-   "progress-active",

[NoCoverage] BlockStatement
index.js:54:106
         statusArr.push(className);
       }
     }
-    if ([statusKeyMap.requestSubmitted, statusKeyMap.requestAcknowledged].includes(currentServiceState)) {
-      statusSubtitle = 'reqDetails.header.submittedSubtitle';
-      statusArr = [];
-    }
+    if ([statusKeyMap.requestSubmitted, statusKeyMap.requestAcknowledged].includes(currentServiceState)) {}
 

[NoCoverage] StringLiteral
index.js:55:24
       }
     }
     if ([statusKeyMap.requestSubmitted, statusKeyMap.requestAcknowledged].includes(currentServiceState)) {
-      statusSubtitle = 'reqDetails.header.submittedSubtitle';
+      statusSubtitle = "";
       statusArr = [];
     }

[NoCoverage] ArrayDeclaration
index.js:56:19
     }
     if ([statusKeyMap.requestSubmitted, statusKeyMap.requestAcknowledged].includes(currentServiceState)) {
       statusSubtitle = 'reqDetails.header.submittedSubtitle';
-      statusArr = [];
+      statusArr = ["Stryker was here"];
     }
 
